
&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыДокументаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыДокументаНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РуководителиПодразделенийСрезПоследних.Подразделение,
	|	РуководителиПодразделенийСрезПоследних.Руководитель,
	|	РуководителиПодразделенийСрезПоследних.РазмерПремии
	|ПОМЕСТИТЬ ВТРуководитель
	|ИЗ
	|	РегистрСведений.РуководителиПодразделений.СрезПоследних(&НачалоМесяца, Подразделение = &Подразделение) КАК РуководителиПодразделенийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Подразделение,
	|	СотрудникиСрезПоследних.ФизическоеЛицо,
	|	СотрудникиСрезПоследних.Должность,
	|	ВТРуководитель.РазмерПремии
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			&НачалоМесяца,
	|			(ФизическоеЛицо, Подразделение) В
	|				(ВЫБРАТЬ
	|					ВТРуководитель.Руководитель,
	|					ВТРуководитель.Подразделение
	|				ИЗ
	|					ВТРуководитель КАК ВТРуководитель)) КАК СотрудникиСрезПоследних,
	|	ВТРуководитель КАК ВТРуководитель";
	
	Запрос.УстановитьПараметр("НачалоМесяца", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Объект.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		Объект.Должность = Выборка.Должность;
		Объект.РазмерПремии = Выборка.РазмерПремии;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	
	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
	
	ЗаполнитьРеквизитыДокументаНаСервере();
	
КонецПроцедуры
