
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	СсылкаНаТекущийВидРасчета = Элементы.Список.ТекущаяСтрока;
	
	Если СсылкаНаТекущийВидРасчета = Неопределено Тогда
	
		 СсылкаНаТекущийВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ДополнительныеНачисления.ПустаяСсылка");
	
	КонецЕсли;
	
	СписокБазовыхНачислений.Параметры.УстановитьЗначениеПараметра("Ссылка",СсылкаНаТекущийВидРасчета);
	СписокВедущихВидовРасчета.Параметры.УстановитьЗначениеПараметра("Ссылка",СсылкаНаТекущийВидРасчета);
	
КонецПроцедуры
