
&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	
	ЗаполнитьТабличныеЧасти(); //Вызов серверной процедуры формы
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеЧасти()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.Объект_ЗаполнитьТЧ(); //Вызов экспортной процедуры объекта
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)

	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;

	
КонецПроцедуры

