&НаКлиенте
Процедура НачисленияВидРасчетаПриИзменении(Элемент)

	ТекДанные = Элементы.Начисления.ТекущиеДанные;

	НачисленияВидРасчетаПриИзмененииНаСервере(ТекДанные.ВидРасчета, ТекДанные.Показатель);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НачисленияВидРасчетаПриИзмененииНаСервере(ВидРасчета, Показатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисления.Показатель
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисления КАК ОсновныеНачисления
	|ГДЕ
	|	ОсновныеНачисления.Ссылка = &ВидРасчета";

	Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Показатель = ВыборкаДетальныеЗаписи.Показатель;	

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УдержанияВидРасчетаПриИзменении(Элемент)

	ТекДанные = Элементы.Удержания.ТекущиеДанные;

	УдержанияВидРасчетаПриИзмененииНаСервере(ТекДанные.ВидРасчета, ТекДанные.Показатель);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдержанияВидРасчетаПриИзмененииНаСервере(ВидРасчета, Показатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Удержания.Показатель
	|ИЗ
	|	ПланВидовРасчета.Удержания КАК Удержания
	|ГДЕ
	|	Удержания.Ссылка = &ВидРасчета";

	Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Показатель = ВыборкаДетальныеЗаписи.Показатель;	

	КонецЦикла;

КонецПроцедуры