
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОПриеме") Тогда

		ДокументОснование = ДанныеЗаполнения;
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КадровоеИзменение") Тогда

		ДокументОснование = ДанныеЗаполнения;
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ОсновныеНачисления.ВидРасчета,
//		|	ОсновныеНачисления.Размер
//		|ПОМЕСТИТЬ ВТОсновныеНачисленияДокумент
//		|ИЗ
//		|	&ОсновныеНачисления КАК ОсновныеНачисления
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ПлановыеОсновныеНачисленияСрезПоследних.ВидРасчета,
//		|	1 Как Номер
//		|ПОМЕСТИТЬ ВТОсновныеНачисления
//		|ИЗ
//		|	РегистрСведений.ПлановыеОсновныеНачисления.СрезПоследних(&Период, ФизическоеЛицо = &ФизическоеЛицо
//		|	И ВидРасчета.ЗачетОтработанногоВремени) КАК ПлановыеОсновныеНачисленияСрезПоследних
//		|ГДЕ
//		|	ПлановыеОсновныеНачисленияСрезПоследних.Размер > 0
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ВТОсновныеНачисленияДокумент.ВидРасчета,
//		|	1
//		|ИЗ
//		|	ВТОсновныеНачисленияДокумент КАК ВТОсновныеНачисленияДокумент
//		|ГДЕ
//		|	ВТОсновныеНачисленияДокумент.Размер = 0 И ВТОсновныеНачисленияДокумент.ВидРасчета.ЗачетОтработанногоВремени
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТОсновныеНачисления.ВидРасчета КАК ВидРасчета,
//		|	Количество(ВТОсновныеНачисления.Номер) КАК КоличествоВидовРасчетов
//		|ИЗ
//		|	ВТОсновныеНачисления КАК ВТОсновныеНачисления
//		|СГРУППИРОВАТЬ ПО
//		|	ВТОсновныеНачисления.ВидРасчета
//		|ИМЕЮЩИЕ
//		|	Не КОЛИЧЕСТВО(ВТОсновныеНачисления.Номер) = 1";
//	
//	Запрос.УстановитьПараметр("ОсновныеНачисления",ОсновныеНачисления);
//	Запрос.УстановитьПараметр("Период",ДатаСобытия);
//	Запрос.УстановитьПараметр("ФизическоеЛицо",ФизическоеЛицо);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//			
//			Отказ = Истина;
//			
//			Сообщение = Новый СообщениеПользователю;
//			Сообщение.Текст = "Для сотрудника нужно указать только (хотя бы) одно начисления, учитывающее отработанное время!";
//			Сообщение.Сообщить();
//			
//	КонецЦикла;
	
КонецПроцедуры
