
Процедура ПередЗаписью(Отказ, Замещение, ТолькоЗапись, ЗаписьФактическогоПериодаДействия, ЗаписьПерерасчетов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеНачисления.ПериодРегистрации
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
	|ГДЕ
	|	ДополнительныеНачисления.Регистратор = &Регистратор";
		
	
	ТекПериод = Константы.ТекущийПериод.Получить();
		
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.ПериодРегистрации <> ТекПериод Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя менять данные другого периода. Текущий период " + Формат(ТекПериод,"ДФ= 'MMMM yyyy'");
			Сообщение.Сообщить();
			
			Отказ = Истина;
			Возврат;
		
		КонецЕсли;
		
	КонецЦикла;
	

	Если Количество() > 0 Тогда
		
		Если Получить(0).ПериодРегистрации <> ТекПериод Тогда
		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя записывать данные другого периода. Текущий период " + Формат(ТекПериод,"ДФ= 'MMMM yyyy'");
			Сообщение.Сообщить();
			
			Отказ = Истина;
		
		КонецЕсли;
		
	
	КонецЕсли;

КонецПроцедуры
