

// ==== УНИВЕРСАЛЬНЫЕ ПРОЦЕДУРЫ ====

// Универсальная процедура заполнения набора записей
Процедура ЗаполнитьНаборЗаписей(ТекстЗапроса, ДокументСсылка, НаборЗаписей) Экспорт
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
	КонецЦикла;
КонецПроцедуры

// Универсальная расчетная процедура
Процедура РассчитатьЗаписиРегистраРасчета(НаборЗаписей, Выборка) Экспорт
	// Обходим в цикле выборку необходимых данных:
	Пока Выборка.Следующий() Цикл
		//  Обнуляем промежуточную переменную Результат:
		Результат = 0; // (-!!!- В видеоролике неправильно, Результат надо обнулять в цикле)
		//  Получаем рассчитываемую запись регистра из набора записей по индексу,
		//   индекс равен [НомерСтроки - 1]:
		ЗаписьРегистра = НаборЗаписей[Выборка.НомерСтроки - 1];
		//  Реализуем расчетные формулы для каждого имеющегося способа расчета, 
		//   результат запоминаем в промежуточной переменной Результат:
		
		// Помещаем результат в запись регистра:
		ЗаписьРегистра.Результат = Результат;
	КонецЦикла;
КонецПроцедуры
