Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.НомерСтроки,
		|	Начисления.ВидРасчета
		|ПОМЕСТИТЬ ВТОсновныеНачисления
		|ИЗ
		|	&Начисления КАК Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ПриказОПриемеНачисления.ВидРасчета) КАК ВидРасчета,
		|	МАКСИМУМ(ПриказОПриемеНачисления.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	ВТОсновныеНачисления КАК ПриказОПриемеНачисления
		|ГДЕ
		|	ПриказОПриемеНачисления.ВидРасчета.ЗачетОтработанногоВремени = ИСТИНА";
	
	Запрос.УстановитьПараметр("Начисления",Начисления);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.ВидРасчета > 1 Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для сотрудника можно указать только одно начисления, учитывающее отработанное время!";
			Сообщение.Поле = "Начисления[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].ВидРасчета";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидРасчета = 0 Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для сотрудника нужно указать одно начисления, учитывающее отработанное время!";
			Сообщение.Поле = "Начисления";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
