&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ТребуетСбораБазыПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()

	Элементы.ГруппаБазовыеВидыРасчета.Видимость = Объект.ТребуетСбораБазы;
	Элементы.ГруппаВедущиеВидыРасчета.Видимость = Объект.ТребуетСбораБазы;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВедущиеВидыРасчета(Команда)
	ПоказатьВопрос(
	Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтотОбъект),
		"Будет перезаполнена таблицы ведущих видов расчета. Продолжить?", РежимДиалогаВопрос.ДаНет, ,
		КодВозвратаДиалога.Да, "Внимание! Процедура необратима!");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		ЗаполнитьВедущиеВидыРасчетаНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВедущиеВидыРасчетаНаСервере()

	ПВРОбъект = РеквизитФормыВЗначение("Объект");

	ПВРОбъект.ВедущиеВидыРасчета.Очистить();

	Для Каждого ТекСтрокаБазовыеВидыРасчета Из ПВРОбъект.БазовыеВидыРасчета Цикл

		ОбщийМодульСервер.ЗаполнитьТабличнуюЧастьВедущиеВидыРасчета(ТекСтрокаБазовыеВидыРасчета.ВидРасчета, ПВРОбъект);

	КонецЦикла;

	ЗначениеВРеквизитФормы(ПВРОбъект, "Объект");
	Модифицированность = Истина;

КонецПроцедуры