Функция ПолучитьЗначениеАктивации() Экспорт

	Возврат Константы.Активация.Получить();

КонецФункции // ПолучитьЗначениеАктивации()

Процедура АктивироватьСистему() Экспорт

	Константы.Активация.Установить(Истина);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриказОПриеме.Ссылка
	|ИЗ
	|	Документ.ПриказОПриеме КАК ПриказОПриеме
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриказОПриеме.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриказОбУвольнении.Ссылка
	|ИЗ
	|	Документ.ПриказОбУвольнении КАК ПриказОбУвольнении
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеЗарплаты.Ссылка
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеЗарплаты.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыГрафиковРаботы.Ссылка,
	|	ВидыГрафиковРаботы.НедельныйГрафик
	|ИЗ
	|	Справочник.ВидыГрафиковРаботы КАК ВидыГрафиковРаботы";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	
	
	Выборка = МассивРезультатов[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл

		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1);
		ДокументОбъект.ДатаСобытия = ДокументОбъект.Дата + 24*60*60*4;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	Выборка = МассивРезультатов[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл

		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1);
		ДокументОбъект.ДатаСобытия = ДокументОбъект.Дата + 24*60*60*3;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;

	Выборка = МассивРезультатов[2].Выбрать();
	
	Дата = НачалоМесяца(ТекущаяДата())+ 24*60*60*5;
	ПериодРегистрации =  ДобавитьМесяц(НачалоМесяца(ТекущаяДата()),-1);
	
	Пока Выборка.Следующий() Цикл

		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = Дата;
		ДокументОбъект.ПериодРегистрации = ПериодРегистрации;
		
		ДокументОбъект.Объект_ЗаполнитьТЧ();
		
		Если ДокументОбъект.Проведен Тогда
			 Режим = РежимЗаписиДокумента.Проведение;
		 Иначе
			 Режим = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
		ДокументОбъект.Записать(Режим);
		
		Дата = ДобавитьМесяц(Дата, -1);
		ПериодРегистрации =  ДобавитьМесяц(ПериодРегистрации,-1);
		
	КонецЦикла;
	
	
	Выборка = МассивРезультатов[3].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ГрафикРаботы.Установить(Выборка.Ссылка);
		НаборЗаписей.Записать();
	
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		НачалоТекущегоГода = НачалоГода(ТекущаяДата());
		Интервал = Новый Структура("ДатаНачала,ДатаОкончания", ДобавитьМесяц(НачалоТекущегоГода, - 12), ДобавитьМесяц(НачалоТекущегоГода, 24));
		
		Если Выборка.НедельныйГрафик Тогда
			
			СправочникОбъект.ЗаполнитьКалендарьЗаИнтервал(Интервал)	
		
		Иначе
			
			СправочникОбъект.ЗаполнитьКалендарь_ПоВременнойСхеме(Интервал)	
		
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры
