
#Область ОбластьКоманд

&НаКлиенте
Процедура РассчитатьРесурсы(Команда)
	
	Если Объект.Проведен = Истина Тогда
	
		ПоказатьВопрос(
		Новый ОписаниеОповещения("РассчитатьРесурсыЗавершение", ЭтотОбъект)
		,"Рассчитывать можно только НЕПРОВЕДЕННЫЙ документ. Отменить проведение?",
		РежимДиалогаВопрос.ДаНет,
		30, КодВозвратаДиалога.Да,"Внимание! Документ проведен.", КодВозвратаДиалога.Да);
		
		Возврат;
	
	КонецЕсли;
	
	РассчитатьРесурсыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРесурсыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
		
		РассчитатьРесурсыНаСервере();
	
	КонецЕсли;
	
	

КонецПроцедуры // РассчитатьРесурсыЗавершение()

&НаСервере
Процедура РассчитатьРесурсыНаСервере()
	
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.РассчитатьРесурсы(); //Вызов экспортной процедуры объекта
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	
КонецПроцедуры




&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	
	ПоказатьВопрос(
	Новый ОписаниеОповещения("ЗаполнитьТЧЗавершение", ЭтотОбъект)
	,"Табличные части, если они заполнены, будут очищены. Продолжить!",
	РежимДиалогаВопрос.ДаНет,
	30, КодВозвратаДиалога.Да,"Внимание", КодВозвратаДиалога.Да);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	
		ЗаполнитьТЧНаСервере(); //Вызов серверной процедуры формы
	
	КонецЕсли;

КонецПроцедуры // ЗаполнитьТЧЗавершение()

&НаСервере
Процедура ЗаполнитьТЧНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.Объект_ЗаполнитьТЧ(); //Вызов экспортной процедуры объекта
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры
	
#КонецОбласти 


#Область ОбработчикиЭлементов

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)

	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
	
КонецПроцедуры
	
#КонецОбласти


#Область ОбработчикиФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.ПериодРегистрации = НачалоМесяца(НачалоМесяца(Объект.Дата) - 1);
	КонецЕсли;

	
КонецПроцедуры
	
#КонецОбласти 



