
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуСписокЗаписейТребующихПерерасчета();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСписокЗаписейТребующихПерерасчета()
	
	Объект.СписокЗаписейТребующихПерерасчета.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Перерасчет.ОбъектПерерасчета,
	|	Перерасчет.ВидРасчета,
	|	Перерасчет.ФизическоеЛицо,
	|	Перерасчет.ОбъектПерерасчета.МоментВремени КАК ОбъектПерерасчетаМоментВремени
	|ИЗ
	|	РегистрРасчета.Начисления.Перерасчет КАК Перерасчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Перерасчет.ОбъектПерерасчета,
	|	Перерасчет.ВидРасчета,
	|	Перерасчет.ФизическоеЛицо,
	|	Перерасчет.ОбъектПерерасчета.МоментВремени
	|ИЗ
	|	РегистрРасчета.Удержания.Перерасчет КАК Перерасчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектПерерасчетаМоментВремени";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		 НоваяСтрока = Объект.СписокЗаписейТребующихПерерасчета.Добавить();
		 
		 ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		 
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура Обновить_(Команда)

	ЗаполнитьТаблицуСписокЗаписейТребующихПерерасчета();	
	
КонецПроцедуры




#Область Перерасчет

&НаСервере
Процедура ПерерасчитатьНаСервере()

	Если Не ЗначениеЗаполнено(ДокументКПерерасчету) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = ДокументКПерерасчету.ПолучитьОбъект();
	
	ДокументОбъект.ПереРассчитатьРесурсы();
		
	ЗаполнитьТаблицуСписокЗаписейТребующихПерерасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура Перерасчитать(Команда)
	
	ПерерасчитатьНаСервере();
	
КонецПроцедуры

#КонецОбласти 



&НаКлиенте
Процедура СписокЗаписейТребующихПерерасчетаПриАктивизацииСтроки(Элемент)

	ТекДанные = Элементы.СписокЗаписейТребующихПерерасчета.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		
		ДокументКПерерасчету = Неопределено;
		
		Возврат;
	
	КонецЕсли;
	
	ДокументКПерерасчету = ТекДанные.ОбъектПерерасчета;
	
КонецПроцедуры



#Область ОчисткаТаблицПерерасчетов

&НаКлиенте
Процедура Очистить_(Команда)
	
	ТеКДанные = Элементы.СписокЗаписейТребующихПерерасчета.ТекущиеДанные;
	
	Если ТеКДанные <> Неопределено Тогда
	
		Очистить_НаСервере(ТеКДанные.ОбъектПерерасчета);
	
	КонецЕсли;
	
	ЗаполнитьТаблицуСписокЗаписейТребующихПерерасчета();	

КонецПроцедуры


&НаСервереБезКонтекста
Процедура Очистить_НаСервере(Ссылка)

	Если Ссылка.Метаданные().Движения.Содержит(Метаданные.РегистрыРасчета.Начисления) Тогда
	
		НаборЗаписей = РегистрыРасчета.Начисления.Перерасчеты.Перерасчет.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектПерерасчета.Установить(Ссылка);
		
		НаборЗаписей.Записать();
	
	КонецЕсли;
	
	
	Если Ссылка.Метаданные().Движения.Содержит(Метаданные.РегистрыРасчета.Удержания) Тогда
	
		НаборЗаписей = РегистрыРасчета.Удержания.Перерасчеты.Перерасчет.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектПерерасчета.Установить(Ссылка);
		
		НаборЗаписей.Записать();
	
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти 
